import random

N = 10**7  # количество извлечения двух шаров
n = 10     # количество шаров в урне
k = 0      # счётчик: второй шар с №2


for i in range(1, N + 1):
    G = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    # вытаскиваем первый шар
    x = random.randint(0, len(G) - 1)
    a = G[x]
    if a != 1:
        # вытаскиваем второй шар
        y = random.randint(0, len(G) - 1)
        b = G[y]
        if b == 2:
            k += 1
    else:
        G.remove(a)
        # вытаскиваем второй шар
        y = random.randint(0, len(G) - 1)
        b = G[y]
        if b == 2:
            k += 1

print("Вероятность путём моделирования =", round(k / N, 7))
print("Вероятность путём аналитики =", round((n ** 2 - n + 1)/(n ** 2 * (n - 1)), 7))